tutorials/multiphaseEuler/boilingBed/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseTurbulenceStabilisationGas
{
    type            phaseTurbulenceStabilisation;
    libs            ("libmultiphaseEulerFvModels.so");
    phase           gas;
    alphaInversion  0.1;
}

phaseTurbulenceStabilisationLiquid
{
    type            phaseTurbulenceStabilisation;
    libs            ("libmultiphaseEulerFvModels.so");
    phase           liquid;
    alphaInversion  0.1;
}

bedHeat
{
    type            semiImplicitSource;

    selectionMode   cellZone;
    cellZone        bed;

    volumeMode      absolute;

    sources
    {
        e.solid
        {
            explicit
            {
                type            scale;
                value           2.3e4;
                scale
                {
                    type            linearRamp;
                    start           0.05;
                    duration        0.1;
                }
            }

            implicit        0;
        }
    }
}


// ************************************************************************* //
